; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	image0 - mode
	thermograph1 - mode
	spectrograph2 - mode
	GroundStation3 - direction
	GroundStation0 - direction
	Star7 - direction
	Star2 - direction
	GroundStation6 - direction
	Star5 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star5)
	(supports instrument1 thermograph1)
	(supports instrument1 image0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star5)
	(supports instrument2 spectrograph2)
	(supports instrument2 image0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet11)
	(supports instrument3 thermograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star2)
	(supports instrument4 image0)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 Star7)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon15)
	(supports instrument5 thermograph1)
	(supports instrument5 spectrograph2)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 spectrograph2)
	(supports instrument6 image0)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 Star7)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument7 image0)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 spectrograph2)
	(supports instrument8 thermograph1)
	(supports instrument8 image0)
	(calibration_target instrument8 GroundStation6)
	(supports instrument9 thermograph1)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 GroundStation4)
	(calibration_target instrument9 Star2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star7)
	(supports instrument10 spectrograph2)
	(supports instrument10 thermograph1)
	(supports instrument10 image0)
	(calibration_target instrument10 GroundStation6)
	(calibration_target instrument10 Star2)
	(supports instrument11 thermograph1)
	(supports instrument11 image0)
	(supports instrument11 spectrograph2)
	(calibration_target instrument11 Star5)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet10)
	(supports instrument12 image0)
	(supports instrument12 spectrograph2)
	(calibration_target instrument12 GroundStation1)
	(calibration_target instrument12 GroundStation4)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation0)
)
(:goal (and
	(pointing satellite2 GroundStation3)
	(pointing satellite3 Star7)
	(pointing satellite4 GroundStation4)
	(pointing satellite5 Star8)
	(have_image Star8 thermograph1)
	(have_image Star9 thermograph1)
	(have_image Planet10 thermograph1)
	(have_image Planet11 spectrograph2)
	(have_image Phenomenon12 image0)
	(have_image Phenomenon13 image0)
	(have_image Phenomenon14 image0)
	(have_image Phenomenon15 spectrograph2)
))

)

; plan
1. (turn_to satellite0 star5 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star5)
   goals met: 2 of 12
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 12
3. (calibrate satellite0 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 2 of 12
4. (turn_to satellite0 planet10 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet10)
   goals met: 2 of 12
5. (take_image satellite0 planet10 instrument1 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 3 of 12
6. (turn_to satellite0 phenomenon15 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon15)
   goals met: 3 of 12
7. (take_image satellite0 phenomenon15 instrument1 spectrograph2)
   added: (have_image phenomenon15 spectrograph2)
   goals met: 4 of 12
8. (turn_to satellite0 phenomenon14 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon14)
   goals met: 4 of 12
9. (take_image satellite0 phenomenon14 instrument1 image0)
   added: (have_image phenomenon14 image0)
   goals met: 5 of 12
10. (turn_to satellite0 phenomenon13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon13)
   goals met: 5 of 12
11. (take_image satellite0 phenomenon13 instrument1 image0)
   added: (have_image phenomenon13 image0)
   goals met: 6 of 12
12. (turn_to satellite0 phenomenon12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon12)
   goals met: 6 of 12
13. (take_image satellite0 phenomenon12 instrument1 image0)
   added: (have_image phenomenon12 image0)
   goals met: 7 of 12
14. (turn_to satellite0 planet11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet11)
   goals met: 7 of 12
15. (take_image satellite0 planet11 instrument1 spectrograph2)
   added: (have_image planet11 spectrograph2)
   goals met: 8 of 12
16. (turn_to satellite0 star8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star8)
   goals met: 8 of 12
17. (take_image satellite0 star8 instrument1 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 9 of 12
18. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 9 of 12
19. (take_image satellite0 star9 instrument1 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 10 of 12
20. (turn_to satellite4 groundstation4 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 groundstation4)
   goals met: 11 of 12
21. (turn_to satellite5 star8 groundstation0)
   deleted: (pointing satellite5 groundstation0)
   added: (pointing satellite5 star8)
   goals met: 12 of 12
